Sharvesh-Vetri/Embedded-Systems-Foundations-PIC16F887-STM32F103C6/PIC16 files/UART/transmission and receiving pair with lcd/rc1.X/rc1.c
/*
 * File:   rc1.c
 * Author: Sharvesh V
 *
 * Created on 16 June, 2025, 12:56 PM
 */

#pragma config FOSC = INTRC_NOCLKOUT
#pragma config WDTE = OFF       
#pragma config PWRTE = ON       
#pragma config MCLRE = ON       
#pragma config CP = OFF         
#pragma config CPD = OFF       
#pragma config BOREN = OFF     
#pragma config IESO = ON        
#pragma config FCMEN = ON       
#pragma config LVP = OFF       
#pragma config BOR4V = BOR40V  
#pragma config WRT = OFF

#include <xc.h>
int i;
char str;

void delay(unsigned int t)
{
    while(t--);
}
void enable()
{
    RE1=1;
    delay(10);
    RE1=0;
    delay(10);
}
void lcd(int rs,char data)
{
    RE0=rs;
    PORTD=data;
    enable();
}
void print(char adrs ,char *ptr)
{
    int j=0;
    for(j=0;*(ptr+j)!='\0';j++)
    {
        RE0=0;
        PORTD=adrs+j;
        enable();
        RE0=1;
        PORTD=*(ptr+j);
        enable();
    }
}

void receive()
{
    while(RCIF==0);
    str=RCREG;
    lcd(1,str);
    RCIF=0;
}

void main(void) 
{
    PORTC=0x00;
    TRISC=0x80;
    PORTD=0x00;
    TRISD=0x00;
    PORTE=0x00;
    TRISE=0x00;
    ANSEL=ANSELH=0x00;
    
    SPBRG=25;
    TXSTA=0x26;
    RCSTA=0x90;
    
    lcd(0,0x38);
    lcd(0,0x0c);
    lcd(0,0x01);
    lcd(0,0x80);
    
    while(1)
    {
        receive();
    }
}

